import React, { useState, useEffect } from 'react';
import { View, Text, TextInput, FlatList, StyleSheet, TouchableOpacity } from 'react-native';

const fetchFAQs = async () => {
    
    return [
        { question: 'מה הקנס על מהירות מורפזת בדרך עירונית?', answer: 'נהיגה במהירות של עד 20 קמש מעל המותר קנס של 250. נהיגה במהירות של 21-30 קמש מעל המותר קנס של 750 שח + רישום של 8 נקודות נהיגה. במהירות של 30 קמש מעל המותר פסילה מנהלית של רישיון הנהיגה ל30 ימים + העמדה לדין + 10 נקודות' },
        { question: 'מה הקנס על מהירות מורפזת בדרך בין עירונית?', answer:  'נהיגה במהירות של עד 25 קמש מעל המותר קנס של 250 שח. נהיגה במהירות של 26-40 קמש מעל המותר קנס של 750 שח + רישום על 8 נקודות. נהיגה במהירות של 40 קמש מעל המותר פסילה מנהלית של רישיון הנהיגה ל30 ימים + העמדה לדין + 10 נקודות.' },
        { question: 'כמה הדוח על מהירות מופרזת?', answer: 'לא נעים לקבל על דוח על מהירות מופרזת, אך יותר מכך לא נעים לקבל דוח על מהירות מופרזת אשר בצידו פסילה מנהלית ואף אפשרות לפסילה תקופתית. אז מה עושים?האופציה הברורה היא - לשלם. האופציה הנוספת היא לבקש להישפט. בטרם תשלום הקנס יש לבקש להישפט תוך 90 ימים ממועד קבלת הדוח. המבקש להישפט יכול לנסות להפחית את גובה הקנס ואף את גובה הכמות הנרשמת לחובתו. בעבירות של נהיגה במהירות גבוה מאוד בהם ניתנת הזמנה לדין, יתייצב הנהג לדיון שייקבע לו. במידה ונפסל רישיונו לנהיגה לתקופה של 30 ימים יוכל גם לפנות לבית המשפט בבקשה דחופה לביטול הפסילה המנהלית. חשוב לדעת כי לא תמיד נכון לשלם את הקנס ולפעמים עדיף להגיע לבית המשפט, לכן עדיף להתייעץ עם עו"ד מומחה בתחום התעבורה בטרם מקבלים החלטות.' },
        { question: 'מה העונש לנהיגה ללא רישיון?', answer: 'נהג אשר נתפס נוהג ללא רישיון נהיגה או נהג אשר רישיונו נפסל אך בכל זאת נתפס נוהג יעמדו לדין ואף יכול וייגזר עליהם מאסר בפועל. בעת מתן גז הדין ניתן לבית המשפט שיקול דעת רחב לקביעת העונש בהתחשב בחומרת העבירה ונסיבותיה כך שיינתן עונש הולם לכל עבירה ונסיבותיה. חשוב להבין כי בשנים האחרונות ולאור הגידול בתאונות הדרכים הנגרמות גם כתוצאה מנהיגה ללא רישיון נהיגה מגמת בית המשפט היא להחמיר את הענישה ולקבוע עונש ברף גבוה. לרוב אלו הם תווכי הענישה: נהיגה ללא רישיון - עד 24 חודשי מאסר + פסילה של רישיון הנהיגה בין 6-60 חודשים + מאסר על תאני + קנס, נהיגה בפסילה - עד 20 חודשי מאסר + פסילה של רישיון הנהיגה בין 6-60 חודשים + מאסר על תאני + קנס. נשאלת השאלה איך בעצם מקבלים פסילה מקום בו אין לנהג כלל רישיון? הפסילה תספר מהמועד בו הוציא הנהג את הרישיון. חשוב לשים לב כי גם נהג אשר הינו בעל רישיון נהיגה בתוקף אך לא לסוג הרכב בו הוא נוהג ייחשב כמי שנהג ללא רישיון. דוגמא לכך הוא אגם בעל רישיון לרכב פרטי אשר נתפס נוהג על אופנוע ללא רישיון מתאים לכך. במקרה זה ייחשב הנהג כמי שנהג ללא רישיון נהיגה.' },
        { question: 'מה הקנס לנסיעה ברמזור אדום?', answer: 'מדובר בעבירה חמורה ביותר שכן מלבד אי הציות לרמזור אדום היא טומנת בחובה סכנת חיים ממש ורואים בחומרה רבה מי שעבר באור אדום. בשל חומרתה של העבירה נקבע כי העונש בגינה הינו קנס כספי בסך של 1,500 שח וכן רישום של 10 נקודות. יחד עם זאת, מדובר בעבירה של ברירת קנס, כך שיכול הנהג לבחור באם לשלם ואז למעשה להודות בקיום העבירה או לבקש להישפט. רק במקרה בו עסקינן בעבירה של נסיעה ברמזור אדום בנסיבות מחמירות, למשל שגרמו לתאונה, יזומן הנהג להישפט בפני בית המשפט ולא יינתן לו רק קנס ונקודות. במקרה כזה העונש יכול להיות אף שלילת רישיון בפועל או על תנאי וקנס כספי גבוה. לפעמים מדובר במצלמות אלקטרוניות אשר צילמו את נהג הרכב חולף באור אדום ואז למעשה יהיה קל יותר להתמודד בבית המשפט וקיימת עדיפות לבקש להישפט. ניתן יהיה לטעון כי לא בעל הרכב הוא שנהג או לחלופין כי הרמזור לא הוצב כדין. מקרים בהם העבירה בוצעה לנגד שוטר אשר רשם דוח פיזי, ניתן יהיה לנסות לערער את אמינותו של השוטר ומהימנותו ולנסות לעורר ספק בעיני בית המשפט בדבר ביצוע העבירה.' },
        { question: 'האם הנני מחויב לעבור בדיקת ינשוף?', answer: 'לכאורה לא ניתן לאלץ אדם לנשוף לתוך צינורית, יחד עם זאת שוטר מוסמך לדרוש מאדם שנהג ברכב לעבור בדיקת שכרות, ובאם הנהג יסרב לבצע את בדיקת הנשיפה הנהג יחשב מבחינת החוק כאילו נמצא נוהג תחת השפעת אלכוהול. סיכון נוסף לנהג סרבן הוא השוטרים יסמנו את התיק של הנהג הסרבן בחותמת מיוחדת המיועדת לתיקים חמורים יותר שההשלכות לכך הן לרעת הנהג הסרבן כמו בדיקה דקדקנית יותר של התיק, קושי בהגעה לפשרה הוגנת ועונשים מחמירים. אם כן, אנו ממליצים לנהג לא לסרב לבדיקת נשיפה, בין אם שתה ובין אם לא, שכן עובדת סירוב זאת תשמש ממילא כראייה נגדו בבית המשפט.' },
        { question: 'מה העונש לנהיגה בקלות ראש?', answer: 'עבירה המתייחסת לנהג שנוהג בקלות ראש, נהג שנוהג ברכב בנהיגה בדרך של קלות ראש, או ברשלנות, או במהירות שיש בה בנסיבות המקרה סכנה לציבור, גם אם היא פחותה מן המהירות המקסימאלית שנקבעה, דינו מאסר שנתיים או קנס. בנוסף לכך, נקבע בפקודה כי נהג שהורשע בעבירה מסוג קלות ראש בית המפשט יפסול את רישיונו לתקופה בת שלושה חודשים.' },
        { question: 'מה העונש לנהיגה בחוסר זהירות?', answer: 'עבירה זו גם היא מתייחסת לנהיגתו של נהג אך פה מדובר על נהיגה בחוסר זהירות. עבירה זו מנויה תחת תקנות התעבורה אשר קובע כי אדם לא ינהג ברכבו בדרך של קלות ראש או בלא זהירות, או ללא תשומת לב מספקת בהתחשב בכל הנסיבות ובין השאר בסוג הרכב, במטענו, בשיטת בלמיו ומצבם, באפשרות של עצירה נוחה ובטוחה והבחנה בתמרורים, באותות שוטרים, בתנועת עוברי דרך ובכל עצם הנמצא על פני הדרך או סמוך לה ובמצב הדרך. הקנס על עבירה זו הוא 500 שח וזוהי עבירה שנחשבת לקלה יותר מנהיגה בקלות ראש, ואין בצידה סנקציה שמנויה בחוק.' },
        { question: 'האם מותר להשתמש בפלאפון ברמזור אדום?', answer: 'אנשים רבים מנצלים את היות הרמזור אדום כדי לשלוח הודעת טקסט, לצפות בתכנים מסוימים או לבצע שיחת טלפון. נשאלת השאלה האם מותר השימוש בטלפון הנייד במהלך עצירה ברמזור אדום. על כך קיימת אי בהירות. מה הכוונה? תקנה 28 לתקנות התעבורה קובעת כדלקמן: נוהג רכב חייב להחזיק בידיו את ההגה או הכידון כל עוד הרכב בתנועה; אולם רשאי הוא להסיר יד אחת מן ההגה או הכידון אם עליו לעשות בה דבר להבטחת פעולתו התקינה של הרכב או לקיום כללי התנועה. יש הסבורים כי עצירה ברמזור אדום אינה מהווה תנועה ועל כן השימוש בטלפון הנייד מותר. בתי המשפט חלוקים בדעתם. ישנם שופטים הסבורים כי שימוש בנייד במצב של אור אדום ברמזור או פקק תנועה בלא תזוזה כלל מותר היות והמחוקק קבע כי על הרכב להיות בתנועה ומשלא קבע במחוקק אחרת עצם העמידה מאפשר את השימוש בנייד. שופטים אחרים סבורים כי עמידה ברמזור אדום הינה חלק אינטגרלי מהתנועה ועל כן גם בעצירה ברמזור אדום או בפקק תנועה השימוש בטלפון הנייד אסור.' },
        { question: 'מה לעשות אם נעצרתי לבדיקת שכרות (אלכוהול או סמים)?', answer: 'תתנהג כראוי, תמעיט בשיחות ותענה בקצרה על השאלות שנשאלות. כמו כן במידה ואתה נלקח לחקירה משטרתית תקפיד לשמור על זכות השתיקה ולדרוש להיוועץ עם עורך דין שמתמחה בדיני תעבורה.' },
        { question: 'מה העונש לנהיגה תחת השפעת סמים?', answer: 'במידה וימצא בגופן של נהג סם מסוכן או תוצר חליפי של הסם בכל כמות שהיא, הנהג יחשב כשיכור. על אף זאת חשוב לדעת כי התביעה תצטרך להוכיח כי נהיגתו של הנהג הושפעה הלכה למעשה מן הסם שנטל, כי היה חשד סביר וכי שרשת המוצג התנהלה כשורה מתחילה ועד כתיבת חוות הדעת. תפקיד הנהג ובא כוחו יהיה לסתור את טענות התביעה. עוד טרם קביעת בית הדין האם הנהג אשם או זכאי רשאי קצין משטרה לפסול את רישיון הנהיגה של המואשם בעבירה לתקופות שונות, בהתאם לתוצאות העבירה.במידה והנהג הורשע בעבירת הנהיגה תחת השפעת סם, מתחם הענישה הינו כדלקמן: פסילת רישיון הנהיגה לתקופת בת לפחות 24 חודשים, למעט בנסיבות מיוחדות. במידה וזוהי עבירת הנהיגה בשכרות השנייה של הנהג, על הנהג יושת עונש של לפחות 4 שנות פסילה. אם מדובר בעבירות חוזרת מצד הנהג, יכול בית המשפט גם להורות על עונש מאסר בפועל.חומרת הענישה בתוך מתחם הענישה תקבע על פי נסיבות המקרה ונסיבותיו האישיות של הנהג, עברו התעבורתי ועוד.' },
    ];
};

const FAQScreen = () => {
    const [faqs, setFaqs] = useState([]);
    const [filteredFaqs, setFilteredFaqs] = useState([]);
    const [searchQuery, setSearchQuery] = useState('');
    const [expandedQuestion, setExpandedQuestion] = useState(null);

    useEffect(() => {
        const initFAQs = async () => {
            const fetchedFaqs = await fetchFAQs();
            setFaqs(fetchedFaqs);
            setFilteredFaqs(fetchedFaqs);
        };
        initFAQs();
    }, []);

    const searchFAQ = (query) => {
        setSearchQuery(query);
        if (query.trim()) {
            const filtered = faqs.filter(faq =>
                faq.question.toLowerCase().includes(query.toLowerCase())
            );
            setFilteredFaqs(filtered);
        } else {
            setFilteredFaqs(faqs);
        }
    };

    const toggleAnswer = (index) => {
        setExpandedQuestion(expandedQuestion === index ? null : index);
    };

    return (
        <View style={styles.container}>
            <TextInput
                placeholder="חפש שאלות..."
                value={searchQuery}
                onChangeText={searchFAQ}
                style={styles.searchBox}
            />
            <FlatList
                data={filteredFaqs}
                keyExtractor={(item, index) => index.toString()}
                renderItem={({ item, index }) => (
                    <TouchableOpacity style={styles.faqItem} onPress={() => toggleAnswer(index)}>
                        <Text style={styles.question}>{item.question}</Text>
                        {expandedQuestion === index && <Text style={styles.answer}>{item.answer}</Text>}
                    </TouchableOpacity>
                )}
            />
        </View>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        justifyContent: 'center', // Center items vertically
        alignItems: 'center',     // Center items horizontally
        marginTop: 80,
        width: "100%"
    },
    searchBox: {
        fontSize: 18,
        padding: 10,
        borderColor: 'gray',
        borderWidth: 1,
        margin: 30,
        textAlign: 'right',
        width: "80%" // Make search box full width
    },
    faqItem: {
        padding: 20,
        borderBottomColor: 'gray',
        borderBottomWidth: 1,
    },
    question: {
        fontWeight: 'bold',
        textAlign: 'right',
        fontSize: 14,
    },
    answer: {
        color: 'gray',
        textAlign: 'right',
    },
});



export default FAQScreen;
